# -*- eval: (let () (org-babel-goto-named-src-block "setup-elisp-env") (org-babel-execute-src-block)); -*-


** List of hyperparams which produce satisfactory results:
#+NAME: setup-elisp-env
#+BEGIN_SRC elisp :results silent
    (defun run-experiment-with-params (root-dir block-name)
    (setq root_dir root-dir)
    (save-excursion
      (goto-char
        (org-babel-find-named-block block-name))
      (org-babel-execute-src-block-maybe))
    )
  (setq digits "33")
  (setq epoch "latest")
#+END_SRC

  #+NAME: generate-table-with-links
  #+BEGIN_SRC python :var table=good-hyperparam-table :var base_dir="nvaes=5_separate_training" :results value :colnames no :hlines yes
    for row in table[1:]:
        if row is None:
          continue
        beta = row[0]
        gamma = row[1]
        run = row[2]
        root_dir = f'../_save/{base_dir}/beta={beta}_gamma={gamma}/run-{run}'
        row[3] = f'[[elisp:(run-experiment-with-params "{root_dir}" "sample-experiment")][click]]'
    return table
  #+END_SRC

  #+NAME:good-hyperparam-table
  #+RESULTS: generate-table-with-links(table=good-hyperparam-table)
  | Beta | Gamma | Run | Link  |
  |------+-------+-----+-------|
  |  0.5 | 0.007 |   1 | [[elisp:(run-experiment-with-params "../_save/nvaes=5_separate_training/beta=0.5_gamma=0.007/run-1" "sample-experiment")][click]] |
  |  0.5 |  0.01 |   1 | [[elisp:(run-experiment-with-params "../_save/nvaes=5_separate_training/beta=0.5_gamma=0.01/run-1" "sample-experiment")][click]] |
  |  0.5 |  0.02 |   1 | [[elisp:(run-experiment-with-params "../_save/nvaes=5_separate_training/beta=0.5_gamma=0.02/run-1" "sample-experiment")][click]] |
  |  0.7 | 0.007 |   1 | [[elisp:(run-experiment-with-params "../_save/nvaes=5_separate_training/beta=0.7_gamma=0.007/run-1" "sample-experiment")][click]] |
  |  0.7 |  0.01 |   1 | [[elisp:(run-experiment-with-params "../_save/nvaes=5_separate_training/beta=0.7_gamma=0.01/run-1" "sample-experiment")][click]] |
  |  0.7 |  0.02 |   1 | [[elisp:(run-experiment-with-params "../_save/nvaes=5_separate_training/beta=0.7_gamma=0.02/run-1" "sample-experiment")][click]] |

  #+NAME: generate-table-with-links(table=good-hyperparam-table)
  #+CALL: generate-table-with-links(table=good-hyperparam-table, base_dir="nvaes=5_separate_training")




 #+NAME: sample-experiment
 #+BEGIN_SRC sh :var root_dir=(identity root_dir) digits=(identity digits) epoch=(identity epoch)
    echo "digits = ${digits}"
    echo "epoch = ${epoch}"
    echo "${root_dir}"
    python3 sample.py --name leonhard --digits "${digits}" --root-dir "${root_dir}" --num-examples 4 --epoch "${epoch}"
 #+END_SRC

 #+RESULTS: sample-experiment
 | digits                                               |                  = |        2e |           |            |
 | epoch                                                |                  = |       690 |           |            |
 | ../_save/together_new_opt/beta=0.5_gamma=0.009/run-2 |                    |           |           |            |
 | KL-0:                                                |          [4.198593 | 1.5773984 | 1.5048207 | 1.5373107] |
 | KL-1:                                                |         [3.6177766 |  5.074603 |  5.151886 | 4.0357475] |
 | KL-2:                                                |         [15.889309 |  16.12903 | 17.736698 | 16.587864] |
 | KL-3:                                                |         [1.7093968 | 1.9174985 |  1.604293 | 1.5695372] |
 | recall_loss_vae_0:                                   | 4.6231889724731445 |           |           |            |
 | recall_loss_vae_1:                                   |  4.174522399902344 |           |           |            |
 | recall_loss_vae_2:                                   | 12.874109268188477 |           |           |            |
 | recall_loss_vae_3:                                   | 0.8502508401870728 |           |           |            |
 | raw_kl_loss_vae_0:                                   | 1.1022653579711914 |           |           |            |
 | raw_kl_loss_vae_1:                                   |  2.235001564025879 |           |           |            |
 | raw_kl_loss_vae_2:                                   |  8.292862892150879 |           |           |            |
 | raw_kl_loss_vae_3:                                   | 0.8500906825065613 |           |           |            |
 | raw_ent_loss:                                        |  4.443578243255615 |           |           |            |
 | total_recall_loss:                                   |  5.630517959594727 |           |           |            |
 | total_loss:                                          | 13.194150924682617 |           |           |            |


